<?php

$yaku_list = [

    '立直' => '門前で聴牌し立直を宣言',

    '門前清自摸和' => '門前で自摸和了',

    '断么九' => '２〜８のみで構成',

    '平和' => 'すべて順子で構成',

    '一盃口' => '同じ順子を2つ持つ',

    '二盃口' => '一盃口を2組',

    '三色同順' => '3種類で同じ順子',

    '三色同刻' => '3種類で同じ刻子',

    '一気通貫' => '123456789を同色で揃える',

    '対々和' => 'すべて刻子',

    '三暗刻' => '暗刻を3つ持つ',

    '三槓子' => '槓子を3つ持つ',

    '小三元' => '三元牌2組＋雀頭',

    '混老頭' => '1・9・字牌のみ',

    '混一色' => '一色＋字牌',

    '清一色' => '一色のみ',

    '混全帯么九' => '全てに么九牌を含む',

    '純全帯么九' => '全てに1・9牌を含む',

    '字一色' => '字牌のみ',

    '緑一色' => '緑牌のみ',

    '七対子' => '7つの対子',

    '国士無双' => '么九牌13種＋1枚',

    '四暗刻' => '暗刻4つ',

    '大三元' => '三元牌3組',

    '小四喜' => '風牌3組＋雀頭',

    '大四喜' => '風牌4組',

    '四槓子' => '槓子4つ'

];